chtMultiregionFoam/snappyMultiRegionHeater/constant/bottomAir/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/bottomAir/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    minX
    {
        type            patch;
        nFaces          80;
        startFace       11196;
    }
    maxX
    {
        type            patch;
        nFaces          80;
        startFace       11276;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          340;
        startFace       11356;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       11696;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       11936;
    }
    bottomAir_to_rightSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       12176;
        sampleMode      nearestPatchFace;
        sampleRegion    rightSolid;
        samplePatch     rightSolid_to_bottomAir;
    }
    bottomAir_to_leftSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       12696;
        sampleMode      nearestPatchFace;
        sampleRegion    leftSolid;
        samplePatch     leftSolid_to_bottomAir;
    }
    bottomAir_to_heater
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          368;
        startFace       13216;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_bottomAir;
    }
)

// ************************************************************************* //
