chtMultiregionFoam/snappyMultiRegionHeater/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       29804;
    }
    minX
    {
        type            patch;
        nFaces          190;
        startFace       30104;
    }
    maxX
    {
        type            patch;
        nFaces          190;
        startFace       30294;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          372;
        startFace       30484;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          570;
        startFace       30856;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          570;
        startFace       31426;
    }
)

// ************************************************************************* //
